#!/usr/bin/env python3
# -*- coding: utf-8 -*-

if __name__ == '__main__':
    # Цена за штуку
    x1 = float(input("Цена обоев: "))  # 8шт. купил
    x2 = float(input("Цена банок краски: "))  # 2шт. купил

    if 200 <= x1 < 500:
        s1 = x1 - x1 * 0.03
    elif 500 <= x1 < 800:
        s1 = x1 - x1 * 0.05
    elif 800 <= x1 < 1000:
        s1 = x1 - x1 * 0.07
    elif 1000 <= x1:
        s1 = x1 - x1 * 0.09

    s1 = s1 * 8  # цена за 8 рулонов с учетом скидки

    if 200 <= x2 < 500:
        s2 = x2 - x2 * 0.03
    elif 500 <= x2 < 800:
        s2 = x2 - x2 * 0.05
    elif 800 <= x2 < 1000:
        s2 = x2 - x2 * 0.07
    elif 1000 <= x2:
        s2 = x2 - x2 * 0.09

    s2 = s2 * 2  # цена за 2 банки краски с учетом скидки

    print("Заплаченая цена с учетом скидки: ", s1 + s2)
